Autodesk.Revit.UI.IExternalEventHandler.GetName
String identification of the event handler.
Returns:
The event's name
Since:
2013

Autodesk.Revit.UI.IExternalEventHandler.Execute(Autodesk.Revit.UI.UIApplication)
This method is called to handle the external event.
Since:
2013

Autodesk.Revit.UI.IExternalEventHandler
An interface to be executed when an external event is raised.
Remarks:
An instance of a class implementing this interface will be registered
with Revit first, and every time the corresponding external event
is raised, the Execute method of this interface will be invoked.
Since:
2013

Autodesk.Revit.UI.IExternalEventHandler.Execute(Autodesk.Revit.UI.UIControlledApplication)
This method is called to handle the external event.
Since:
2013

Autodesk.Revit.UI.IExternalEventHandler.Execute(Autodesk.Revit.VSTA.ApplicationEntryPoint)
This method is called to handle the external event.
Since:
2013